{
  "metadata": {
    "title": "Отчёт по лабораторной работе №2 «Настройка рабочего окружения для веб-разработки»",
    "discipline": "ИТиВП. Часть 1",
    "group": "",
    "student": "",
    "year": "2026"
  },
  "elements": [
    {"type": "heading1", "id": "goal", "text": "ЦЕЛЬ РАБОТЫ", "numbered": false},
    {"type": "paragraph", "text": "Формирование практических навыков настройки современного рабочего окружения для полноценной веб-разработки. Освоение инструментов контроля версий, создание и конфигурация проекта, изучение базовых возможностей интегрированной среды разработки и инструментов проектирования."},
    {"type": "heading1", "id": "intro", "text": "ВВЕДЕНИЕ", "numbered": false},
    {"type": "paragraph", "text": "Современная веб-разработка опирается на жизненный цикл разработки ПО (SDLC) и набор инструментов: систему контроля версий, среду разработки, пакетный менеджер и средства проектирования интерфейсов. В работе рассматриваются установка и настройка Node.js, Git, Visual Studio Code и Figma, создание структуры проекта и интеграция инструментов."},
    {"type": "paragraph", "text": "Система контроля версий Git позволяет фиксировать изменения кода, хранить историю и совместно работать над проектом. Интегрированная среда разработки (IDE) VS Code предоставляет редактор кода, терминал, отладку и расширения. Node.js и npm дают возможность подключать библиотеки и скрипты. Figma используется для проектирования интерфейсов и экспорта стилей в код."},
    {"type": "heading1", "id": "part1", "text": "ХОД РАБОТЫ"},
    {"type": "heading2", "id": "part1_1", "text": "Часть 1. Установка базового программного обеспечения"},
    {"type": "paragraph", "text": "Установлена LTS-версия Node.js с официального сайта nodejs.org. В терминале VS Code выполнены команды проверки: node --version и npm --version. Полученные версии: Node.js v24.9.0, npm 11.6.0."},
    {"type": "paragraph", "text": "Установлен Git с сайта git-scm.com. Проверка: git --version — git version 2.50.1. Настроены глобальные параметры user.name и user.email. Установлен VS Code с code.visualstudio.com. Зарегистрирован аккаунт на figma.com, изучен интерфейс и создан файл проекта."},
    {"type": "figure", "image_path": "images/01-node-npm.png", "caption": "Проверка версий Node.js и npm в терминале VS Code"},
    {"type": "heading2", "id": "part1_2", "text": "Часть 2. Настройка VS Code и установка расширений"},
    {"type": "paragraph", "text": "Изучены элементы интерфейса VS Code: панель активности, боковая панель, редактор, панель состояния, встроенный терминал (Ctrl+`). Установлены расширения: Live Server, Auto Rename Tag, Prettier - Code formatter, GitLens, ES6 String HTML, Figma to Code. Проверена работа терминала с Git и npm, автодополнение."},
    {"type": "figure", "image_path": "images/02-vscode-extensions.png", "caption": "Интерфейс VS Code с открытым проектом и установленными расширениями"},
    {"type": "heading2", "id": "part1_3", "text": "Часть 3. Создание и настройка проекта"},
    {"type": "paragraph", "text": "Создана папка проекта и открыта в VS Code. В терминале выполнено создание структуры каталогов: mkdir css js assets images design. Созданы файлы index.html с базовой HTML5-разметкой, css/style.css с базовыми стилями, js/script.js с простым скриптом. В Figma создан мудборд, определена цветовая палитра и шрифты, выполнен прототип главной страницы."},
    {"type": "figure", "image_path": "images/03-project-structure.png", "caption": "Структура проекта в проводнике VS Code"},
    {"type": "figure", "image_path": "images/04-figma-mockup.png", "caption": "Figma-макет с прототипом страницы"},
    {"type": "heading2", "id": "part1_4", "text": "Часть 4. Работа с системой контроля версий через VS Code"},
    {"type": "paragraph", "text": "В терминале выполнено git init. Создан файл .gitignore с исключениями node_modules/, .DS_Store, *.log. Через вкладку Source Control (Ctrl+Shift+G) файлы добавлены в staging area и создан коммит с сообщением «Initial commit: project structure». Создан удалённый репозиторий на GitHub/GitLab, выполнены git remote add origin <URL> и git push -u origin main."},
    {"type": "figure", "image_path": "images/05-source-control.png", "caption": "Вкладка Source Control с историей коммитов"},
    {"type": "figure", "image_path": "images/06-github-repo.png", "caption": "Репозиторий на GitHub/GitLab"},
    {"type": "heading2", "id": "part1_5", "text": "Часть 5. Интеграция инструментов разработки"},
    {"type": "paragraph", "text": "Выполнена инициализация npm-проекта (npm init -y), установлены пакеты: lodash (npm install lodash) и nodemon (npm install --save-dev nodemon). Создан файл .prettierrc для настроек форматирования; в VS Code включено форматирование при сохранении. Ссылка на Figma-макет сохранена в design/figma-link.txt; при необходимости использовано расширение Figma to Code для экспорта стилей."},
    {"type": "heading2", "id": "part1_6", "text": "Часть 6. Выполнение унифицированного задания"},
    {"type": "paragraph", "text": "Настроена структура папок и базовые файлы HTML, CSS, JS в соответствии с тематикой проекта. Инициализирован Git-репозиторий, настроен удалённый репозиторий, выполнены коммиты через VS Code. Установлены и настроены расширения VS Code, форматирование с Prettier, npm-проект с базовыми зависимостями. В Figma созданы цветовая палитра, типографика и прототип главной страницы; ресурсы экспортированы. Создан README.md с описанием проекта, технологий и ссылками на Figma и репозиторий."},
    {"type": "heading1", "id": "links", "text": "ССЫЛКИ"},
    {"type": "paragraph", "text": "Удалённый репозиторий: (указать URL после создания на GitHub/GitLab)."},
    {"type": "paragraph", "text": "Figma-макет проекта: (указать URL после создания и вставить в design/figma-link.txt)."},
    {"type": "heading1", "id": "control", "text": "ОТВЕТЫ НА КОНТРОЛЬНЫЕ ВОПРОСЫ"},
    {"type": "heading2", "id": "q1", "text": "Вопрос 1"},
    {"type": "paragraph", "text": "Основные преимущества IDE (VS Code) перед простыми редакторами: единое окружение с терминалом, отладкой, автодополнением и рефакторингом; интеграция с Git (Source Control, GitLens); расширения (Live Server, Prettier, Figma to Code) ускоряют разработку и форматирование. Наиболее полезны расширения Live Server для быстрого просмотра страниц, Prettier для единого стиля кода и GitLens для навигации по истории изменений."},
    {"type": "heading2", "id": "q2", "text": "Вопрос 2"},
    {"type": "paragraph", "text": "Git в VS Code интегрирован через панель Source Control (Ctrl+Shift+G): здесь виден список изменённых файлов, можно добавлять файлы в staging (иконка «+»), вводить сообщение коммита и выполнять коммит. Через терминал выполняются git init, git remote add, git push. Основные этапы: инициализация репозитория (git init), создание .gitignore, добавление файлов и первый коммит через интерфейс, привязка удалённого репозитория и отправка кода (git push)."},
    {"type": "heading1", "id": "conclusions", "text": "ВЫВОДЫ", "numbered": false},
    {"type": "paragraph", "text": "В ходе работы установлены и настроены Node.js (v24.9.0), npm (11.6.0), Git (2.50.1), Visual Studio Code и зарегистрирован аккаунт Figma. Создана структура веб-проекта с папками css, js, assets, images, design и базовыми файлами index.html, style.css, script.js. Инициализирован Git-репозиторий, создан .gitignore и выполнен первый коммит; подготовлена настройка удалённого репозитория и отправка кода. Установлены расширения VS Code (Live Server, Prettier, GitLens и др.) и настроено форматирование через .prettierrc. Инициализирован npm-проект, установлены пакеты lodash и nodemon. Изучены основы Figma и подготовлено место для макета и ссылки в design/figma-link.txt. Составлен README.md с описанием технологий и ссылками. Цель работы достигнута: сформированы практические навыки настройки рабочего окружения для веб-разработки и освоены базовые операции с Git и инструментами разработки."},
    {"type": "sources", "items": [
      "СТП 01–2024. Оформление пояснительных записок. БГУИР;",
      "Node.js. – Режим доступа: https://nodejs.org/ (дата обращения: 15.02.2026);",
      "Git. – Режим доступа: https://git-scm.com/ (дата обращения: 15.02.2026);",
      "Visual Studio Code. – Режим доступа: https://code.visualstudio.com/ (дата обращения: 15.02.2026);",
      "Figma. – Режим доступа: https://figma.com (дата обращения: 15.02.2026)."
    ]}
  ]
}
